from PySide2.QtWidgets import QApplication
from mainwin import MyMainWin


def main():
    app = QApplication()
    w = MyMainWin()
    w.show()
    app.exec_()


if __name__ == '__main__':
    main()
    info_str = ',1323184,,1323182,,1323186' \
               ',黄花茅草/果树草/黑麦草/草地羊茅草/梯牧草/小糠草/草地早熟禾,花生,猫上皮,分枝孢霉/毛霉/根霉/白色念珠菌,苦艾' \
               ',100820,1323186,1323186,1323164,104761,64114,1323186,1323186,1323186,84736' \
               ',鸡蛋,杨树/柳树,棉絮,大豆,烟草屑' \
               ',26193,131393,1323186,1323186,69341,4302,80329,145622,1323186,42978' \
               ',蜜蜂毒,交链孢霉,普通豚草,狗上皮,蒲公英' \
               ',35213,1323184,93710,68645,77,44898,1323186,75471,64360,0' \
               ',柏树,屋尘螨,蚊子唾液,艾蒿,牛奶' \
               ',24805,66965,114458,1323183,85446,1323106,77360,1323186,1323186,1323175'

